Ahmed-Mohamed-Fathy/STM32u5/TEST_U5/Core/Src/lcd_touch.c
#include "main.h"
#include "lcd_touch.h"
#include "stm32u5xx_hal.h"
#include <stdlib.h>
#include "font.h"
//#include "font8.h"
#include "font16.h"
#include "printf.h"
#include <string.h>
#define LCD_CS_GPIO_PORT	GPIOB
#define LCD_CS_PIN			GPIO_PIN_0
#define LCD_CS_IDLE()		LCD_CS_GPIO_PORT->BSRR = LCD_CS_PIN						// CS_HIGH
#define LCD_CS_ACTIVE()		LCD_CS_GPIO_PORT->BSRR = (uint32_t)LCD_CS_PIN << 16U	// CS_LOW

#define LCD_CD_GPIO_PORT	GPIOC
#define LCD_CD_PIN			GPIO_PIN_3        //RS     A4
#define LCD_CD_DATA()		LCD_CD_GPIO_PORT->BSRR = LCD_CD_PIN						// CD_HIGH
#define LCD_CD_COMMAND()	LCD_CD_GPIO_PORT->BSRR = (uint32_t)LCD_CD_PIN << 16U	// CD_LOW

#define LCD_RST_GPIO_PORT	GPIOC
#define LCD_RST_PIN			GPIO_PIN_1
#define LCD_RST_IDLE()		LCD_RST_GPIO_PORT->BSRR = LCD_RST_PIN					// RST_HIGH
#define LCD_RST_ACTIVE()	LCD_RST_GPIO_PORT->BSRR = (uint32_t)LCD_RST_PIN << 16U	// RST_LOW

#define LCD_WR_GPIO_PORT	GPIOA                     //wr A1
#define LCD_WR_PIN			GPIO_PIN_2
#define LCD_WR_IDLE()		LCD_WR_GPIO_PORT->BSRR = LCD_WR_PIN						// WR_HIGH
#define LCD_WR_ACTIVE()		LCD_WR_GPIO_PORT->BSRR = (uint32_t)LCD_WR_PIN << 16U	// WR_LOW

#define LCD_RD_GPIO_PORT	GPIOA
#define LCD_RD_PIN			GPIO_PIN_3
#define LCD_RD_IDLE()		LCD_RD_GPIO_PORT->BSRR = LCD_RD_PIN						// RD_HIGH
#define LCD_RD_ACTIVE()		LCD_RD_GPIO_PORT->BSRR = (uint32_t)LCD_RD_PIN << 16U	// RD_LOW

static int16_t m_width;
static int16_t m_height;
static int16_t m_cursor_x;
static int16_t m_cursor_y;
//static uint8_t _cp437= 0;
static uint16_t m_textcolor;
static uint16_t m_textbgcolor;
static uint8_t m_font;
static int16_t m_rotation;
static uint8_t m_scale;
static uint8_t m_wrap;
//
//extern ADC_HandleTypeDef hadc1;
//extern ADC_HandleTypeDef hadc2;

static font_t * fonts[] = {
#ifdef USE_FONT8
		&Font8,
#endif
#ifdef USE_FONT12
		&Font12,
#endif
#ifdef USE_FONT16
		&Font16,
#endif
#ifdef USE_FONT20
		&Font20,
#endif
#ifdef USE_FONT24
		&Font24,
#endif
};

#ifdef USE_FONT8
extern font_t Font8;
#endif
#ifdef USE_FONT12
extern font_t Font12;
#endif
#ifdef USE_FONT16
extern font_t Font16;
#endif
#ifdef USE_FONT20
extern font_t Font20;
#endif
#ifdef USE_FONT24
extern font_t Font24;
#endif


#define ADC_NO_TOUCH_X_OUTSIDE (4095 - 100)
#define TOUCH_ADC_X_MAX 3796
#define TOUCH_ADC_X_MIN 288
#define TOUCH_ADC_Y_MIN 191
#define TOUCH_ADC_Y_MAX 3483

//static const float ADC_UNIT_PX_X = 1.0 / (TOUCH_ADC_X_MAX - TOUCH_ADC_X_MIN);
//static const float ADC_UNIT_PX_Y = 1.0 / (TOUCH_ADC_Y_MAX - TOUCH_ADC_Y_MIN);

//static ADC_HandleTypeDef* hadcX = NULL;
//static ADC_HandleTypeDef* hadcY = NULL;
//static uint32_t ADC_ChannelX;
//static uint32_t ADC_ChannelY;
//static LCD_TouchState m_touch_state = LCD_TOUCH_IDLE;
//static LCD_TouchPoint* m_last_point_ref = NULL;

//static float fclamp(float x, float l, float u) {
//	return x < l ? l : (x > u ? u : x);
//}
//
//static float adc_norm_x(uint32_t x) {
//	return (x - TOUCH_ADC_X_MIN) * ADC_UNIT_PX_X;
//}
//
//static float adc_norm_y(uint32_t y) {
//	return (y - TOUCH_ADC_Y_MIN) * ADC_UNIT_PX_Y;
//}

#define swap(a, b)			do {\
		int16_t t = a;\
		a = b;\
		b = t;\
} while(0)
//static uint8_t rotationNum=1;
//#define LCD_WR_STROBE() 	do {
//								LCD_WR_ACTIVE();
//								HAL_Delay(3);
//								LCD_WR_IDLE();
//								HAL_Delay(3);
//							} while(0)
//#define LCD_RD_STROBE() 	do {
//								LCD_RD_ACTIVE();
//								HAL_Delay(3);
//								LCD_RD_IDLE();
//								HAL_Delay(3);
//							} while(0)

static void LCD_GPIO_Init(uint32_t mode) {


	if (!(mode == GPIO_MODE_OUTPUT_PP || mode == GPIO_MODE_INPUT)) return;

	GPIO_InitTypeDef GPIO_InitStruct;

	/* GPIO Ports Clock Enable */
	__GPIOA_CLK_ENABLE();
	__GPIOB_CLK_ENABLE();
	__GPIOC_CLK_ENABLE();
	__GPIOE_CLK_ENABLE();
	__GPIOF_CLK_ENABLE();
	__GPIOG_CLK_ENABLE();

	/*Configure GPIO data pins : PA2 , PA3  */
	GPIO_InitStruct.Pin = GPIO_PIN_2 | GPIO_PIN_3 ;
	GPIO_InitStruct.Mode = mode;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/*Configure GPIO data pins : PB0 */
	GPIO_InitStruct.Pin = GPIO_PIN_0 ;
	GPIO_InitStruct.Mode = mode;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	/*Configure GPIO data pins : PC0 , PC1 , PC3 */
	GPIO_InitStruct.Pin = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_3  ;
	GPIO_InitStruct.Mode = mode;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

	/*Configure GPIO data pins : PD15 */
	GPIO_InitStruct.Pin = GPIO_PIN_15 ;
	GPIO_InitStruct.Mode = mode;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

	/*Configure GPIO data pins : PE9 , PE11 ,PE13 */
	GPIO_InitStruct.Pin = GPIO_PIN_9 | GPIO_PIN_11 | GPIO_PIN_13 ;
	GPIO_InitStruct.Mode = mode;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

	/*Configure GPIO data pins : PF12 , PF13 , PF14 , PF15 */
	GPIO_InitStruct.Pin = GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15 ;
	GPIO_InitStruct.Mode = mode;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);

	/*Configure GPIO data pins : PG7 , PG8*/
	GPIO_InitStruct.Pin = GPIO_PIN_7 | GPIO_PIN_8  ;
	GPIO_InitStruct.Mode = mode;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
	HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);


}



static inline void LCD_Write8(uint8_t d) {

	LCD_CS_ACTIVE();

	GPIOD->BSRR = (1<<15) << 16;
	GPIOF->BSRR = ((1<<12)|(1<<15)|(1<<14)|(1<<13)) << 16;
	GPIOE->BSRR = ((1<<13)|(1<<11)|(1<<9)) << 16;

	GPIOF->BSRR =    (((d) & (1<<0)) << 12)
				   | (((d) & (1<<7)) << 6)
				   | (((d) & (1<<4)) << 10)
				   | (((d) & (1<<2)) << 13);

	GPIOE->BSRR = (((d) & (1<<6)) << 3)
				   | (((d) & (1<<5)) << 6)
				   | (((d) & (1<<3)) << 10);

