Ahmed-Mohamed-Fathy/STM32u5/TEST_U5/Core/Src/lcd_touch.c
	GPIOD->BSRR = (((d) & (1<<1)) << 14);


	LCD_WR_ACTIVE();
	LCD_WR_IDLE();

	LCD_CS_IDLE();
}

void TFT_24S_Write_Command(uint16_t command)
{
	LCD_CD_COMMAND();
	LCD_Write8(command);

}
void TFT_24S_Write_Data(uint16_t data)
{
	LCD_CD_DATA();
	LCD_Write8(data);

}

static inline void LCD_Write8Register8(uint8_t a, uint8_t d)
{
	LCD_CD_COMMAND();
	LCD_Write8(a);

	LCD_CD_DATA();
	LCD_Write8(d);

}

static inline void LCD_Write16Register8(uint8_t a, uint16_t d) {
	LCD_CD_COMMAND();
	LCD_Write8(a);

	LCD_CD_DATA();
	LCD_Write8(d >> 8);
	LCD_Write8(d);
}

static inline void LCD_Write24Register8(uint8_t a, uint32_t d) {
	LCD_CD_COMMAND();
	LCD_Write8(a);

	LCD_CD_DATA();
	LCD_Write8(d >> 16);
	LCD_Write8(d >> 8);
	LCD_Write8(d);

}

static inline void LCD_Write32Register8(uint8_t a, uint32_t d) {
	LCD_CD_COMMAND();
	LCD_Write8(a);

	LCD_CD_DATA();
	LCD_Write8(d >> 24);
	LCD_Write8(d >> 16);
	LCD_Write8(d >> 8);
	LCD_Write8(d);
}


static inline void LCD_Write16Register16(uint16_t a, uint16_t d) {
	LCD_CD_COMMAND();

	LCD_Write8(a >> 8);
	LCD_Write8(a);

	LCD_CD_DATA();
	LCD_Write8(d >> 8);
	LCD_Write8(d);

}

static inline void LCD_Write16RegisterPair8(uint8_t aH, uint8_t aL, uint16_t d) {
	LCD_Write8Register8(aH, d >> 8);
	LCD_Write8Register8(aL, d);
}
static inline uint8_t LCD_Read8(void) {
	// - Data - ----------- PORT -----------
	// BIT 0 -> GPIOA, GPIO_PIN_9  -> 0x0200
	// BIT 1 -> GPIOC, GPIO_PIN_7  -> 0x0080
	// BIT 2 -> GPIOA, GPIO_PIN_10 -> 0x0400
	// BIT 3 -> GPIOB, GPIO_PIN_3  -> 0x0008
	// BIT 4 -> GPIOB, GPIO_PIN_5  -> 0x0020
	// BIT 5 -> GPIOB, GPIO_PIN_4  -> 0x0010
	// BIT 6 -> GPIOB, GPIO_PIN_10 -> 0x0400
	// BIT 7 -> GPIOA, GPIO_PIN_8  -> 0x0100
	uint8_t data;
	LCD_RD_ACTIVE();
    HAL_Delay(5);
	data = ((GPIOD->IDR & (1<<15)) >> 14)
					| ((GPIOF->IDR & (1<<12)) >> 12)
					| ((GPIOF->IDR & (1<<13)) >> 6)
					| ((GPIOF->IDR & (1<<14)) >> 10)
					| ((GPIOF->IDR & (1<<15)) >> 13)
					| ((GPIOE->IDR & (1<<9))  >> 3)
					| ((GPIOE->IDR & (1<<11)) >> 6)
					| ((GPIOE->IDR & (1<<13)) >> 10);
	LCD_RD_IDLE();
    HAL_Delay(5);

	return data;
}
static inline uint8_t LCD_Read8Register8(uint8_t a, uint8_t dummy) {
	uint8_t data;
	LCD_CD_COMMAND();

	LCD_Write8(a);


	LCD_CS_ACTIVE();

	LCD_CD_DATA();

	LCD_GPIO_Init(GPIO_MODE_INPUT);
    HAL_Delay(5);
	if (dummy)
	{
		LCD_RD_ACTIVE();

		LCD_RD_IDLE();
	}
	data = LCD_Read8();

	LCD_GPIO_Init(GPIO_MODE_OUTPUT_PP);
	LCD_CS_IDLE();

	return data;
}



void LCD_init(void)
{
	//	volatile uint32_t temp=0;
	m_width = TFTWIDTH;
	m_height = TFTHEIGHT;
	m_rotation = 0;
	m_cursor_y = m_cursor_x = 0;
	m_font = 0;
	m_textcolor = BLUE;
	m_textbgcolor = WHITE;
	m_wrap = 1;
	LCD_GPIO_Init(GPIO_MODE_OUTPUT_PP);
	LCD_CS_ACTIVE();
	LCD_CD_COMMAND();
	LCD_RST_IDLE();
	LCD_WR_ACTIVE();
	LCD_RD_ACTIVE();
	HAL_Delay(10);

	LCD_CS_IDLE();
	LCD_CD_DATA();
	LCD_RST_ACTIVE();
	LCD_WR_IDLE();
	LCD_RD_IDLE();
	HAL_Delay(20);

	LCD_CS_ACTIVE();
	LCD_CD_COMMAND();
	LCD_RST_IDLE();
	LCD_WR_ACTIVE();
	LCD_RD_ACTIVE();
	HAL_Delay(20);


	LCD_CS_IDLE();
	LCD_WR_IDLE();
	LCD_RD_IDLE();
	LCD_CS_ACTIVE();

	//	  TFT_24S_Write_Command(0xF7); // Pump ratio control
	//	  TFT_24S_Write_Data(0x20); //
	//
	//	  TFT_24S_Write_Command(0x3A); // COLMOD: Pixel Format Set
	//	  TFT_24S_Write_Data(0x55);
	//
	//	  TFT_24S_Write_Command(0x36); // Memory Access Control
	//
	//	  TFT_24S_Write_Data(0x08);
	//
	//	  TFT_24S_Write_Command(0x11); // Sleep OUT
	//	  TFT_24S_Write_Command(0x29); // Display ON

	TFT_24S_Write_Command (ILI9341_RESET); // software reset comand
	HAL_Delay(100);
	TFT_24S_Write_Command (ILI9341_DISPLAY_OFF); // display off
	//------------power control------------------------------
	TFT_24S_Write_Command (ILI9341_POWER1); // power control
	   (0x26); // GVDD = 4.75v
	TFT_24S_Write_Command (ILI9341_POWER2); // power control
	TFT_24S_Write_Data   (0x11); // AVDD=VCIx2, VGH=VCIx7, VGL=-VCIx3
	//--------------VCOM-------------------------------------
	TFT_24S_Write_Command (ILI9341_VCOM1); // vcom control
	TFT_24S_Write_Data   (0x35); // Set the VCOMH voltage (0x35 = 4.025v)
	TFT_24S_Write_Data   (0x3e); // Set the VCOML voltage (0x3E = -0.950v)
	TFT_24S_Write_Command (ILI9341_VCOM2); // vcom control
	TFT_24S_Write_Data   (0xbe);

	//------------memory access control------------------------
	TFT_24S_Write_Command (ILI9341_MAC); // memory access control
	TFT_24S_Write_Data(0x48);

	TFT_24S_Write_Command (ILI9341_PIXEL_FORMAT); // pixel format set
	TFT_24S_Write_Data   (0x55); // 16bit /pixel

	TFT_24S_Write_Command(ILI9341_FRC);
	TFT_24S_Write_Data(0);
	TFT_24S_Write_Data(0x1F);
	//-------------ddram ----------------------------
	TFT_24S_Write_Command (ILI9341_COLUMN_ADDR); // column set
	TFT_24S_Write_Data   (0x00); // x0_HIGH---0
	TFT_24S_Write_Data   (0x00); // x0_LOW----0
	TFT_24S_Write_Data   (0x00); // x1_HIGH---240
	TFT_24S_Write_Data   (0xEF); // x1_LOW----240
	TFT_24S_Write_Command (ILI9341_PAGE_ADDR); // page address set
	TFT_24S_Write_Data   (0x00); // y0_HIGH---0
	TFT_24S_Write_Data   (0x00); // y0_LOW----0
	TFT_24S_Write_Data   (0x01); // y1_HIGH---320
	TFT_24S_Write_Data   (0x3F); // y1_LOW----320

	TFT_24S_Write_Command (ILI9341_TEARING_OFF); // tearing effect off
	//LCD_write_cmd(ILI9341_TEARING_ON); // tearing effect on
	//LCD_write_cmd(ILI9341_DISPLAY_INVERSION); // display inversion
	TFT_24S_Write_Command (ILI9341_Entry_Mode_Set); // entry mode set
	// Deep Standby Mode: OFF
	// Set the output level of gate driver G1-G320: Normal display
	// Low voltage detection: Disable
	TFT_24S_Write_Data   (0x07);
	//-----------------display------------------------
	TFT_24S_Write_Command (ILI9341_DFC); // display function control
	//Set the scan mode in non-display area
	//Determine source/VCOM output in a non-display area in the partial display mode
	TFT_24S_Write_Data   (0x0a);
	//Select whether the liquid crystal type is normally white type or normally black type
	//Sets the direction of scan by the gate driver in the range determined by SCN and NL
	//Select the shift direction of outputs from the source driver
	//Sets the gate driver pin arrangement in combination with the GS bit to select the optimal scan mode for the module
	//Specify the scan cycle interval of gate driver in non-display area when PTG to select interval scan
	TFT_24S_Write_Data   (0x82);
	// Sets the number of lines to drive the LCD at an interval of 8 lines
	TFT_24S_Write_Data   (0x27);
	TFT_24S_Write_Data   (0x00); // clock divisor

	TFT_24S_Write_Command (ILI9341_SLEEP_OUT); // sleep out
	HAL_Delay(150);
	TFT_24S_Write_Command (ILI9341_DISPLAY_ON); // display on
	HAL_Delay(150);
	TFT_24S_Write_Command (ILI9341_GRAM); // memory write
	HAL_Delay(5);

