Ahmed-Mohamed-Fathy/STM32u5/TEST_U5/Core/Src/lcd_touch.c
}

void LCD_Flood(uint16_t color, uint32_t len) {
	uint8_t hi = color >> 8, lo = color;

	LCD_Write16Register8(ILI9341_MEMORYWRITE, color);
	len--;
	if (hi == lo) {
		while (len--) {
			LCD_WR_ACTIVE();

			LCD_WR_IDLE();


		}
	}
	else {
		while (len--) {

			LCD_Write8(hi);
			LCD_Write8(lo);
		}
	}

}

void LCD_SetAddrWindow(uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2) {
	LCD_Write32Register8(ILI9341_COLADDRSET, (x1 << 16) | x2);
	LCD_Write32Register8(ILI9341_PAGEADDRSET, (y1 << 16) | y2);
	TFT_24S_Write_Command(0x2C); // write to RAM
}


void LCD_FillScreen(uint16_t color) {
	LCD_SetAddrWindow(0, 0, 240 - 1, 320 - 1);
	LCD_Flood(color, (long) TFTWIDTH * (long) TFTHEIGHT);
}


void LCD_SetRotation(uint8_t x) {
	m_rotation = (x & 3);
	switch (m_rotation) {
	default:
	case 0:
	case 2:
		m_width = TFTWIDTH;
		m_height = TFTHEIGHT;
		break;
	case 1:
	case 3:
		m_width = TFTHEIGHT;
		m_height = TFTWIDTH;
		break;
	}
	LCD_CS_ACTIVE();
	uint8_t t;
	switch (m_rotation) {
	default: t = ILI9341_MADCTL_MX | ILI9341_MADCTL_BGR; break;
	case 1: t = ILI9341_MADCTL_MV | ILI9341_MADCTL_BGR; break;
	case 2: t = ILI9341_MADCTL_MY | ILI9341_MADCTL_BGR; break;
	case 3:	t = ILI9341_MADCTL_MX | ILI9341_MADCTL_MY | ILI9341_MADCTL_MV | ILI9341_MADCTL_BGR; break;
	}
	LCD_Write8Register8(ILI9341_MADCTL, t); // MADCTL
	// For 9341, init default full-screen address window:
	LCD_SetAddrWindow(0, 0, m_width - 1, m_height - 1);
	LCD_CS_IDLE();
}

void LCD_DrawBMP(int16_t xPos, int16_t yPos, const uint8_t *pBmp) {
	uint8_t *ptr;
	uint8_t *start;
	uint8_t *end;
	uint32_t offset = 0, size = 0;
	int32_t height = 0, width = 0;
	uint16_t colordepth = 0;

	/* Read bitmap size */
	size = *(volatile uint16_t *) (pBmp + 2);
	size |= (*(volatile uint16_t *) (pBmp + 4)) << 16;
	/* Get bitmap data address offset */
	offset = *(volatile uint16_t *) (pBmp + 10);
	offset |= (*(volatile uint16_t *) (pBmp + 12)) << 16;
	/* Read bitmap width */
	width = *(uint16_t *) (pBmp + 18);
	width |= (*(uint16_t *) (pBmp + 20)) << 16;
	/* Read bitmap height */
	height = *(uint16_t *) (pBmp + 22);
	height |= (*(uint16_t *) (pBmp + 24)) << 16;
	/* Read color depth */
	colordepth = *(uint16_t *) (pBmp + 28);

	/* Calculate pixel data boundary addresses */
	start = (uint8_t *) pBmp + offset;
	end = (uint8_t *) pBmp + size;

	/* Start drawing */
	if ((xPos + width >= m_width) || (yPos + abs(height) >= m_height)) return;
	LCD_SetAddrWindow(xPos, yPos, xPos + width - 1, yPos + abs(height) - 1);
	LCD_CS_ACTIVE();
	LCD_CD_COMMAND();
	LCD_Write8(ILI9341_MEMORYWRITE); // Write data to GRAM
	LCD_CD_DATA();
	if (height < 0) {
		/* Top-bottom file */
		ptr = start;
		/* Draw image */
		if (colordepth == 16) {
			while (ptr < end) {
				LCD_Write8(*(ptr + 1));
				LCD_Write8(*(ptr));
				ptr += 2;
			}
		} else if (colordepth == 24) {
			while (ptr < end) {
				ptr += 3;
			}
		}
	} else {
		/* Bottom-top file */
		uint8_t *rowstart;
		uint8_t *rowend;
		/* Draw image */
		if (colordepth == 16) {
			for (uint16_t row = height - 1; row > 0; row--) {
				rowstart = start + row * width * 2;
				rowend = start + (row + 1) * width * 2 - 1;
				ptr = rowstart;
				while (ptr < rowend) {
					ptr += 2;
				}
			}
		} else if (colordepth == 24) {
			for (uint16_t row = height - 1; row > 0; row--) {
				rowstart = start + row * width * 3;
				rowend = start + (row + 1) * width * 3 - 1;
				ptr = rowstart;
				while (ptr < rowend) {
					ptr += 3;
				}
			}
		}
	}
	LCD_CS_IDLE();
	LCD_SetAddrWindow(0, 0, m_width - 1, m_height - 1);
}


void LCD_DrawPixel(int16_t x, int16_t y, uint16_t color) {
	// Clip
	if ((x < 0) || (y < 0) || (x >= m_width) || (y >= m_height)) return;

	LCD_CS_ACTIVE();
	LCD_SetAddrWindow(x, y, m_width - 1, m_height - 1);
	LCD_CS_ACTIVE();
	LCD_Write16Register8(ILI9341_MEMORYWRITE, color);
	LCD_CS_IDLE();
}

void LCD_DrawLine(int16_t x0, int16_t y0, int16_t x1, int16_t y1, uint16_t color) {
	// Bresenham's algorithm - thx wikpedia

	int16_t steep = abs(y1 - y0) > abs(x1 - x0);
	if (steep) {
		swap(x0, y0);
		swap(x1, y1);
	}

	if (x0 > x1) {
		swap(x0, x1);
		swap(y0, y1);
	}

	int16_t dx, dy;
	dx = x1 - x0;
	dy = abs(y1 - y0);

	int16_t err = dx / 2;
	int16_t ystep;

	if (y0 < y1) {
		ystep = 1;
	} else {
		ystep = -1;
	}

	for (; x0 <= x1; x0++) {
		if (steep) {
			LCD_DrawPixel(y0, x0, color);
		} else {
			LCD_DrawPixel(x0, y0, color);
		}
		err -= dy;
		if (err < 0) {
			y0 += ystep;
			err += dx;
		}
	}
}

void LCD_DrawFastHLine(int16_t x, int16_t y, int16_t length, uint16_t color) {
	int16_t x2;

	// Initial off-screen clipping
	if ((length <= 0) || (y < 0) || (y >= m_height) || (x >= m_width) ||
			((x2 = (x + length - 1)) < 0)) return;

	if (x < 0) { // Clip left
		length += x;
		x = 0;
	}

	if (x2 >= m_width) { // Clip right
		x2 = m_width - 1;
		length = x2 - x + 1;
	}

	LCD_SetAddrWindow(x, y, x2, y);
	LCD_Flood(color, length);
	LCD_SetAddrWindow(0, 0, m_width - 1, m_height - 1);

}

void LCD_DrawFastVLine(int16_t x, int16_t y, int16_t length, uint16_t color) {
	int16_t y2;

	// Initial off-screen clipping
	if ((length <= 0) || (x < 0) || (x >= m_width) || (y >= m_height) ||
			((y2 = (y+length-1)) <  0)) return;

	if (y < 0) { // Clip top
		length += y;
		y = 0;
	}
	if (y2 >= m_height) { // Clip bottom
		y2 = m_height - 1;
		length = y2 - y + 1;
	}
	LCD_SetAddrWindow(x, y, x, y2);
	LCD_Flood(color, length);
	LCD_SetAddrWindow(0, 0, m_width - 1, m_height - 1);
}

void LCD_DrawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
	LCD_DrawFastHLine(x, y, w, color);
	LCD_DrawFastHLine(x, y + h - 1, w, color);
	LCD_DrawFastVLine(x, y, h, color);
	LCD_DrawFastVLine(x + w - 1, y, h, color);
}

void LCD_FillRect(int16_t x, int16_t y1, int16_t w, int16_t h, uint16_t color) {
	int16_t x2, y2;

	// Initial off-screen clipping
	if ((w <= 0) || (h <= 0) || (x >= m_width) || (y1 >= m_height)
			|| ((x2 = x + w - 1) < 0) || ((y2 = y1 + h - 1) < 0))
		return;
	if (x < 0) { // Clip left
		w += x;
		x = 0;
	}
	if (y1 < 0) { // Clip top
		h += y1;
		y1 = 0;
	}
	if (x2 >= m_width) { // Clip right
		x2 = m_width - 1;
		w = x2 - x + 1;
	}
	if (y2 >= m_height) { // Clip bottom
		y2 = m_height - 1;
		h = y2 - y1 + 1;
	}

