Ahmed-Mohamed-Fathy/STM32u5/TEST_U5/Core/Src/lcd_touch.c
	for (uint32_t i = 0; i < height; i++) {
		pchar = ((uint8_t *) &fonts[fontindex]->table[charindex] + (width + 7) / 8 * i);
		switch (bytes) {
		case 1:
			line = pchar[0];
			break;
		case 2:
			line = (pchar[0] << 8) | pchar[1];
			break;
		case 3:
		default:
			line = (pchar[0] << 16) | (pchar[1] << 8) | pchar[2];
			break;
		}
		if (m_scale) {
			for (uint32_t j = 0; j < width * 2; j+=2) {
				if (line & (1 << (width - j / 2 + offset - 1))) {
					LCD_FillRect(x + j, y, 2, 2, color);
				} else {
					LCD_FillRect(x + j, y, 2, 2, bg);
				}
			}
			y+=2;
		} else {
			for (uint32_t j = 0; j < width; j++) {
				if (line & (1 << (width - j + offset - 1))) {
					LCD_DrawPixel((x + j), y, color);
				} else {
					LCD_DrawPixel((x + j), y, bg);
				}
			}
			y++;
		}
	}
}

// fmt for data to be printed
// width for data position in x axis
// height for data position in y axis

void LCD_Printf(const char *fmt,uint16_t width,uint16_t height,...)
{
	volatile uint16_t h ,w ;
	h = height;
	w = width;
	static char buf[256];
	char *p;
	va_list lst;

	va_start(lst, fmt);
	vsnprintf(buf, sizeof(buf), fmt, lst);
	va_end(lst);

//	volatile uint16_t height , width ;
	height = fonts[m_font]->Height;
	width = fonts[m_font]->Width;
	if (m_scale) {
		height *= 2;
		width *= 2;
	}
	p = buf;
	while (*p) {
		if (*p == '\n') {
			m_cursor_y += height;
			m_cursor_x = 0;
		} else if (*p == '\r') {
			m_cursor_x = 0;
		} else if (*p == '\t') {
			m_cursor_x += width * 4;
		} else {
#ifdef WIPE_LINES
			if (m_cursor_x == 0) {
				LCD_SetAddrWindow(0, m_cursor_y, m_width - 1, m_cursor_y + height);
				LCD_Flood(m_textbgcolor, (long) m_width * height);
				LCD_SetAddrWindow(0, 0, m_width - 1, m_height - 1);
			}
#endif
			if (m_cursor_y >= (m_height - height)) {
				m_cursor_y = 0;
#ifdef WIPE_SCREEN
				LCD_FillScreen(m_textbgcolor);
#endif
			}
			LCD_DrawChar(m_cursor_x+w, m_cursor_y+h, *p, m_textcolor, m_textbgcolor, m_font);
			m_cursor_x += width;
			if (m_wrap && (m_cursor_x > (m_width - width))) {
				m_cursor_y += height;
				m_cursor_x = 0;
			}
		}
		p++;
	}
}


void GPIO_DrawMode(void) {
	/* GPIO Ports Clock Enable */
	__HAL_RCC_GPIOA_CLK_ENABLE();
	;
	__HAL_RCC_GPIOB_CLK_ENABLE();
	;
	__HAL_RCC_GPIOC_CLK_ENABLE();
	;
	HAL_NVIC_DisableIRQ(EXTI0_IRQn);

	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
	//XP=PA8 XM=PA1 YP=PA4 YM=PB10 alt

	//XP=PA9 XM=PA4 YP=PB0 YM=PC7 neu

	/*Configure GPIO pins: PA1 PA4 PA8 */
	GPIO_InitStruct.Pin = GPIO_PIN_4 | GPIO_PIN_9 ;
	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

	/*Configure GPIO data pin PB10 */
	GPIO_InitStruct.Pin = GPIO_PIN_0;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	GPIO_InitStruct.Pin = GPIO_PIN_7;
	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
}

//static void GPIO_InterruptMode() {
//	  GPIO_InitTypeDef GPIO_InitStruct = {0};
//
//	  /* GPIO Ports Clock Enable */
//		//XP=PA8 XM=PA1 YP=PA4 YM=PB10 alt
//
//		//XP=PA9 XM=PA4 YP=PB0 YM=PC7 neu
//	  __HAL_RCC_GPIOC_CLK_ENABLE();
//
//	/* X- PA1 */
//	GPIO_InitStruct.Pin = GPIO_PIN_4;
//	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
//	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
//
//	/* X+ PA8 */
//	GPIO_InitStruct.Pin = GPIO_PIN_9;
//	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
//
//	/* Y- PB10 */
//	GPIO_InitStruct.Pin = GPIO_PIN_7;
//	GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
//
//	/* Y+ PA4 */
//	  GPIO_InitStruct.Pin = GPIO_PIN_0;
//	  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
//	  GPIO_InitStruct.Pull = GPIO_PULLUP;
//	  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
//	  HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0);
//	  HAL_NVIC_EnableIRQ(EXTI0_IRQn);
//}

//static uint32_t ADC_GetValue(ADC_HandleTypeDef* hadc, uint32_t channel) {
//	ADC_ChannelConfTypeDef sConfig;
//
//	sConfig.Channel = channel;
//	sConfig.Rank = 1;
//	sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
//	HAL_ADC_ConfigChannel(hadc, &sConfig);
//
//	// start conversion
//	HAL_ADC_Start(hadc);
//
//	// wait until finish
//	HAL_ADC_PollForConversion(hadc, 100);
//
//	uint32_t value = HAL_ADC_GetValue(hadc);
//
//	HAL_ADC_Stop(hadc);
//
//	return value;
//}

//static void GPIO_SetPinMode(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin,
//		uint32_t GPIO_PinMode) {
//	GPIO_InitTypeDef GPIO_InitStruct;
//	GPIO_InitStruct.Pin = GPIO_Pin;
//	GPIO_InitStruct.Mode = GPIO_PinMode;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//	HAL_GPIO_Init(GPIOx, &GPIO_InitStruct);
//}

//static void ADC_GPIOA_init(uint16_t GPIO_Pin) {
//	GPIO_InitTypeDef GPIO_InitStruct;
//	GPIO_InitStruct.Pin = GPIO_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
//}
//
//static void ADC_GPIOB_init(uint16_t GPIO_Pin) {
//	GPIO_InitTypeDef GPIO_InitStruct;
//	GPIO_InitStruct.Pin = GPIO_Pin;
//	GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
//	GPIO_InitStruct.Pull = GPIO_NOPULL;
//	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
//}

//uint32_t touchX(void) {
//	GPIO_SetPinMode(GPIOA, GPIO_PIN_4, GPIO_MODE_OUTPUT_PP);
//	GPIO_SetPinMode(GPIOA, GPIO_PIN_9, GPIO_MODE_OUTPUT_PP);
//	GPIO_SetPinMode(GPIOC, GPIO_PIN_7, GPIO_MODE_INPUT);
//	ADC_GPIOB_init(GPIO_PIN_0);
//
//	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_4, GPIO_PIN_RESET);
//	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_9, GPIO_PIN_SET);
//
//	return (int16_t) ((1 - fclamp(adc_norm_x(ADC_GetValue(&hadc1, ADC_CHANNEL_8)), 0.0f, 1.0f)) * TFTWIDTH);
//}

//XP=PA8 XM=PA1 YP=PA4 YM=PB10 alt

//XP=PA9 XM=PA4 YP=PB0 YM=PC7 neu

//uint32_t touchY(void) {
//	HAL_NVIC_DisableIRQ(EXTI0_IRQn);
//	GPIO_SetPinMode(GPIOC, GPIO_PIN_7, GPIO_MODE_OUTPUT_PP);
//	GPIO_SetPinMode(GPIOB, GPIO_PIN_0, GPIO_MODE_OUTPUT_PP);  //exti
//	GPIO_SetPinMode(GPIOA, GPIO_PIN_9, GPIO_MODE_INPUT);
//	ADC_GPIOA_init(GPIO_PIN_4);
//
//	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_7, GPIO_PIN_RESET);
//	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, GPIO_PIN_SET);
//
//	uint32_t adc_y = ADC_GetValue(&hadc2, ADC_CHANNEL_4);
//
//	__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_0);
//	HAL_NVIC_ClearPendingIRQ(EXTI0_IRQn);
//	HAL_NVIC_EnableIRQ(EXTI0_IRQn);
//
//	return (int16_t) ((1 - fclamp(adc_norm_y(adc_y), 0.0f, 1.0f)) * TFTHEIGHT);
//}

//LCD_TouchReadState LCD_Touch_Read(LCD_TouchPoint* p) {
//
////	GPIO_InterruptMode();
//
//	if (hadcX == NULL || hadcY == NULL) {
//		return LCD_TOUCH_READ_NOT_INITIALIZED;
//	}
//	if (m_touch_state == LCD_TOUCH_IDLE) {
//		return LCD_TOUCH_READ_NO_TOUCH;
//	}
//	uint32_t x = touchX();
//
//	if (x > ADC_NO_TOUCH_X_OUTSIDE) {
//		return LCD_TOUCH_READ_OUTSIDE;
//	}
//
//	uint32_t y = touchY();
//
//	p->x = (int16_t) ((1 - fclamp(adc_norm_x(x), 0.0f, 1.0f)) * TFTWIDTH);
//	p->y = (int16_t) ((1 - fclamp(adc_norm_y(y), 0.0f, 1.0f)) * TFTHEIGHT);
//	return LCD_TOUCH_READ_SUCCESS;
//}
